Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АбонементПакетУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АбонементЧленство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Посещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПрихода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВъездаНаПарковку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыездаСПарковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПосещениеЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/PocketKey_Модуль/Ext/Module.bsl
#Область Типовые_процедуры_и_функции

// Функция, возвращает номер шкафчика и сейфа.
//
Функция PocketKey_ПолучитьНомерШкафчикаИСейфа(ДанныеШкафчиков, КодШкафчиков, КодСейфов) Экспорт
	
	НомерШкафчика = 0;
	НомерСейфа    = 0;
	
	Попытка
		Массив = СтрРазделить(ДанныеШкафчиков, ";", Ложь);	
		Для Каждого СтрокаМ из Массив Цикл
			Если СтрНайти(СтрокаМ, КодШкафчиков + ":") > 0 Тогда
				НомерШкафчика = Число(Сред(СтрокаМ, СтрДлина(КодШкафчиков + " :")));
			ИначеЕсли СтрНайти(СтрокаМ, КодСейфов + ":") > 0 Тогда
				НомерСейфа    = Число(Сред(СтрокаМ, СтрДлина(КодСейфов + " :")));
			КонецЕсли;				
		КонецЦикла;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Новый Структура("НомерШкафчика, НомерСейфа, ОписаниеОшибки", НомерШкафчика, НомерСейфа, ТекстОшибки);	
	
КонецФункции

// Функция, возвращает данные карты (владельца) по коду справочника.
//
Функция PocketKey_ПолучитьДанныеКартыПоКодуБиометрии(КодБиометрии) Экспорт
	
	ТипСправочника = Сред(КодБиометрии, 1, 1);
	КодСправочника = Сред(КодБиометрии, 2); 
	
	Если ТипСправочника = "E" Тогда
		Объект = Справочники.Сотрудники.НайтиПоКоду(КодСправочника);
	ИначеЕсли ТипСправочника = "C" Тогда
		Объект = Справочники.Контрагенты.НайтиПоКоду(КодСправочника);	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеКарты = Новый Структура;
	ДанныеКарты.Вставить("Карта"                  , Новый Структура("ЗанятКлиентом", Объект));
	ДанныеКарты.Вставить("ВладелецКарты"          , Объект);
	ДанныеКарты.Вставить("ПометкаУдаления"        , Объект.ПометкаУдаления);
	ДанныеКарты.Вставить("Заблокирована"          , Ложь);
	ДанныеКарты.Вставить("НеИспользоватьБиометрию", Ложь);
	ДанныеКарты.Вставить("КодВладельца"           , Объект.Код);
	
	Возврат ДанныеКарты; 
	
КонецФункции

// Функция, конвертирует код карты.
//
Функция PocketKey_КонвертироватьКодКарты(КодКарты) Экспорт
	
	ПерваяЧасть = Сред(КодКарты, СтрДлина(КодКарты) - 5, 2); 
	ВтораяЧасть = Сред(КодКарты, СтрДлина(КодКарты) - 3);
	ч1 = Формат(PocketKey_Модуль.PocketKey_Конвертировать_16_В_10_СС(ПерваяЧасть), "ЧГ=");	
	ч2 = Формат(PocketKey_Модуль.PocketKey_Конвертировать_16_В_10_СС(ВтораяЧасть), "ЧГ=");
	Пока СтрДлина(ч1) < 3 Цикл
		ч1 = "0" + ч1;  
	КонецЦикла;
	Пока СтрДлина(ч2) < 5 Цикл
		ч2 = "0" + ч2;  
	КонецЦикла;	
	
	КодКарты1с = ч1 + ","+ч2;

	Возврат КодКарты1с;
	
КонецФункции

// Функция, конвертирует значение.
//
Функция PocketKey_Конвертировать_16_В_10_СС(Знач Значение) Экспорт
	
	Шаблон = "0123456789ABCDEF";
	
    Значение = ВРег(Значение); // на всякий случай.
    ДлинаШаблона = СтрДлина(Шаблон);

    ДлинаСтроки = СтрДлина(Значение);
    Результат = 0;

    Для ТекСимвол = 1 По ДлинаСтроки Цикл
        ОбрабатываемыйСимвол = Сред(Значение, ТекСимвол,1);
        ПозицияВШаблоне = Найти(Шаблон, ОбрабатываемыйСимвол)-1;
        Результат = Результат * ДлинаШаблона + ПозицияВШаблоне;
    КонецЦикла;

    Возврат(Результат);

КонецФункции

// Функция, возвращает текст запроса.
//
Функция PocketKey_ПолучитьТаблицуЧленств(СтруктурнаяЕдиница, Клиент, ТекущаяДата) Экспорт
	
	//ЗМВ{[+](фрагмент ДОБАВЛЕН), 19.12.2025 10:15:11
	ТаблицаБессрочныхЧленств = PocketKey_ПолучитьТаблицуБесрочныхЧленств(СтруктурнаяЕдиница, Клиент, ТекущаяДата);
	
	Если ТаблицаБессрочныхЧленств.Количество() > 0 Тогда
		Возврат ТаблицаБессрочныхЧленств;
	КонецЕсли;
	//ЗМВ}[+] 19.12.2025 10:15:11
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЧленств.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия КАК ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще КАК ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип КАК ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг КАК ВидЧленстваПакетаУслуг
	|ПОМЕСТИТЬ ТаблицаЧленств
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			ЧленствоПакетУслуг.Контрагент = &Клиент
	|				И НЕ ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И ЧленствоПакетУслуг.ТипЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.АбонементЧленство)
	|				И НЕ ЧленствоПакетУслуг.ОбязательноеНаличиеРезерваПриВходе
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	//++ЛАА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
	|		ПО (СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг)
	//--ЛАА
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//++ЛАА
	|	И ЧленстваПакетыУслугИтоги.СрокДействия >= &ТекущаяДата
	|	И НЕ СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.Наименование ПОДОБНО ""%ДКК%""
	//--ЛАА
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			&Клиент В (ЧленствоПакетУслуг.ДополнительныеВладельцы.Контрагент)
	|				И НЕ ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И ЧленствоПакетУслуг.ТипЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.АбонементЧленство)
	|				И НЕ ЧленствоПакетУслуг.ОбязательноеНаличиеРезерваПриВходе
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	//++ЛАА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
	|		ПО (СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг)
	//--ЛАА
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//++ЛАА
	|	И ЧленстваПакетыУслугИтоги.СрокДействия >= &ТекущаяДата
	|   И НЕ СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.Наименование ПОДОБНО ""%ДКК%""
	//--ЛАА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЧленств.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	|	ТаблицаЧленств.ОграничениеПоВремениДействия КАК ОграничениеПоВремениДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены КАК ОграниченияПоВремениДействияИзменены,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия КАК НоменклатураОграничениеПоВремениДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям КАК ОграничениеПоПомещениям,
	|	ТаблицаЧленств.ПосещенийНеЧаще КАК ПосещенийНеЧаще,
	|	ТаблицаЧленств.ПосещенийНеЧащеТип КАК ПосещенийНеЧащеТип,
	|	NULL КАК ВремяПосещенияНеБолее,
	|	1 КАК Остаток,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели КАК ДеньНедели,
	|		ВремяС КАК ВремяС,
	|		ВремяПо КАК ВремяПо
	|	) КАК ВремяДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели КАК ДеньНедели,
	|		ВремяС КАК ВремяС,
	|		ВремяПо КАК ВремяПо
	|	) КАК НоменклатураВремяДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение КАК ОснованиеПомещение
	|	) КАК ДоступКПомещениям,
	|	ТаблицаЧленств.ВидЧленстваПакетаУслуг КАК ВидЧленстваПакетаУслуг,
	|	1 КАК Приоритет,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки КАК ТребуетсяМедСправка,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК ДокументПродажи,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку КАК ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки КАК ШаблонРассрочки,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента КАК СуммаПродажи,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТаблицаЧленств КАК ТаблицаЧленств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяПосещенияНеБолее,
	|	ЕСТЬNULL(ЧленстваПакетыУслугОстатки.КоличествоОстаток, 0),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг,
	|	2,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			ЧленствоПакетУслуг.Контрагент = &Клиент
	|				И ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И НЕ ЧленствоПакетУслуг.РезервироватьЗанятия
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЧленстваПакетыУслуг.Остатки(
	|				,
	|				НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг) ЕСТЬ NULL
	|					И ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).Контрагент = &Клиент
	|					И УслугаСегмент = НЕОПРЕДЕЛЕНО
	|					И НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ОбязательноеНаличиеРезерваПриВходе) КАК ЧленстваПакетыУслугОстатки
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугОстатки.Основание
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяПосещенияНеБолее,
	|	ЕСТЬNULL(ЧленстваПакетыУслугОстатки.КоличествоОстаток, 0),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг,
	|	2,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			&Клиент В (ЧленствоПакетУслуг.ДополнительныеВладельцы.Контрагент)
	|				И ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И НЕ ЧленствоПакетУслуг.РезервироватьЗанятия
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЧленстваПакетыУслуг.Остатки(
	|				,
	|				НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг) ЕСТЬ NULL
	|					И ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ДополнительныеВладельцы.Контрагент = &Клиент
	|					И УслугаСегмент = НЕОПРЕДЕЛЕНО
	|					И НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ОбязательноеНаличиеРезерваПриВходе) КАК ЧленстваПакетыУслугОстатки
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугОстатки.Основание
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Клиент"			  , Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата"		  , ТекущаяДата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//++ ЗМВ 20.06.2025

// Функция, возвращает текст запроса.
//
Функция PocketKey_ПолучитьТаблицуПакетовУслуг(СтруктурнаяЕдиница, Клиент, ТекущаяДата) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЧленств.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия КАК ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще КАК ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип КАК ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг КАК ВидЧленстваПакетаУслуг
	|ПОМЕСТИТЬ ТаблицаЧленств
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			ЧленствоПакетУслуг.Контрагент = &Клиент
	|				И НЕ ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И ЧленствоПакетУслуг.ТипЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.АбонементПакетУслуг)
	|				И НЕ ЧленствоПакетУслуг.ОбязательноеНаличиеРезерваПриВходе
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	//++ЛАА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
	|		ПО (СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг)
	//--ЛАА
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//++ЛАА
	|	И ЧленстваПакетыУслугИтоги.СрокДействия >= &ТекущаяДата
	|	И НЕ СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.Наименование ПОДОБНО ""%ДКК%""
	//--ЛАА
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			&Клиент В (ЧленствоПакетУслуг.ДополнительныеВладельцы.Контрагент)
	|				И НЕ ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И ЧленствоПакетУслуг.ТипЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.АбонементЧленство)
	|				И НЕ ЧленствоПакетУслуг.ОбязательноеНаличиеРезерваПриВходе
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	//++ЛАА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
	|		ПО (СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг)
	//--ЛАА
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//++ЛАА
	|	И ЧленстваПакетыУслугИтоги.СрокДействия >= &ТекущаяДата
	|   И НЕ СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.Наименование ПОДОБНО ""%ДКК%""
	//--ЛАА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЧленств.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	|	ТаблицаЧленств.ОграничениеПоВремениДействия КАК ОграничениеПоВремениДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены КАК ОграниченияПоВремениДействияИзменены,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия КАК НоменклатураОграничениеПоВремениДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям КАК ОграничениеПоПомещениям,
	|	ТаблицаЧленств.ПосещенийНеЧаще КАК ПосещенийНеЧаще,
	|	ТаблицаЧленств.ПосещенийНеЧащеТип КАК ПосещенийНеЧащеТип,
	|	NULL КАК ВремяПосещенияНеБолее,
	|	1 КАК Остаток,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели КАК ДеньНедели,
	|		ВремяС КАК ВремяС,
	|		ВремяПо КАК ВремяПо
	|	) КАК ВремяДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели КАК ДеньНедели,
	|		ВремяС КАК ВремяС,
	|		ВремяПо КАК ВремяПо
	|	) КАК НоменклатураВремяДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение КАК ОснованиеПомещение
	|	) КАК ДоступКПомещениям,
	|	ТаблицаЧленств.ВидЧленстваПакетаУслуг КАК ВидЧленстваПакетаУслуг,
	|	1 КАК Приоритет,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки КАК ТребуетсяМедСправка,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК ДокументПродажи,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку КАК ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки КАК ШаблонРассрочки,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента КАК СуммаПродажи,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТаблицаЧленств КАК ТаблицаЧленств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяПосещенияНеБолее,
	|	ЕСТЬNULL(ЧленстваПакетыУслугОстатки.КоличествоОстаток, 0),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг,
	|	2,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			ЧленствоПакетУслуг.Контрагент = &Клиент
	|				И ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И НЕ ЧленствоПакетУслуг.РезервироватьЗанятия
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЧленстваПакетыУслуг.Остатки(
	|				,
	|				НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг) ЕСТЬ NULL
	|					И ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).Контрагент = &Клиент
	|					И УслугаСегмент = НЕОПРЕДЕЛЕНО
	|					И НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ОбязательноеНаличиеРезерваПриВходе) КАК ЧленстваПакетыУслугОстатки
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугОстатки.Основание
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяПосещенияНеБолее,
	|	ЕСТЬNULL(ЧленстваПакетыУслугОстатки.КоличествоОстаток, 0),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг,
	|	2,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			&Клиент В (ЧленствоПакетУслуг.ДополнительныеВладельцы.Контрагент)
	|				И ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И НЕ ЧленствоПакетУслуг.РезервироватьЗанятия
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЧленстваПакетыУслуг.Остатки(
	|				,
	|				НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг) ЕСТЬ NULL
	|					И ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ДополнительныеВладельцы.Контрагент = &Клиент
	|					И УслугаСегмент = НЕОПРЕДЕЛЕНО
	|					И НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ОбязательноеНаличиеРезерваПриВходе) КАК ЧленстваПакетыУслугОстатки
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугОстатки.Основание
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Клиент"			  , Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата"		  , ТекущаяДата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//--ЗМВ 20.06.2025

//ЗМВ{[+](фрагмент ДОБАВЛЕН), 19.12.2025 10:02:43

// Функция, возвращает текст запроса.
//
Функция PocketKey_ПолучитьТаблицуБесрочныхЧленств(СтруктурнаяЕдиница, Клиент, ТекущаяДата)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЧленств.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия КАК ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще КАК ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип КАК ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг КАК ВидЧленстваПакетаУслуг
	|ПОМЕСТИТЬ ТаблицаЧленств
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			ЧленствоПакетУслуг.Контрагент = &Клиент
	|				И НЕ ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И ЧленствоПакетУслуг.ТипЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.АбонементЧленство)
	|				И НЕ ЧленствоПакетУслуг.ОбязательноеНаличиеРезерваПриВходе
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	//++ЛАА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
	|		ПО (СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг)
	//--ЛАА
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//++ЛАА
	|	И ЧленстваПакетыУслугИтоги.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.Наименование ПОДОБНО ""%ДКК%""
	//--ЛАА
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			&Клиент В (ЧленствоПакетУслуг.ДополнительныеВладельцы.Контрагент)
	|				И НЕ ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И ЧленствоПакетУслуг.ТипЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.АбонементЧленство)
	|				И НЕ ЧленствоПакетУслуг.ОбязательноеНаличиеРезерваПриВходе
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	//++ЛАА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
	|		ПО (СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг)
	//--ЛАА
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//++ЛАА
	|	И ЧленстваПакетыУслугИтоги.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|   И НЕ СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.Наименование ПОДОБНО ""%ДКК%""
	//--ЛАА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЧленств.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	|	ТаблицаЧленств.ОграничениеПоВремениДействия КАК ОграничениеПоВремениДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены КАК ОграниченияПоВремениДействияИзменены,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия КАК НоменклатураОграничениеПоВремениДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям КАК ОграничениеПоПомещениям,
	|	ТаблицаЧленств.ПосещенийНеЧаще КАК ПосещенийНеЧаще,
	|	ТаблицаЧленств.ПосещенийНеЧащеТип КАК ПосещенийНеЧащеТип,
	|	NULL КАК ВремяПосещенияНеБолее,
	|	1 КАК Остаток,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели КАК ДеньНедели,
	|		ВремяС КАК ВремяС,
	|		ВремяПо КАК ВремяПо
	|	) КАК ВремяДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели КАК ДеньНедели,
	|		ВремяС КАК ВремяС,
	|		ВремяПо КАК ВремяПо
	|	) КАК НоменклатураВремяДействия,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение КАК ОснованиеПомещение
	|	) КАК ДоступКПомещениям,
	|	ТаблицаЧленств.ВидЧленстваПакетаУслуг КАК ВидЧленстваПакетаУслуг,
	|	1 КАК Приоритет,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки КАК ТребуетсяМедСправка,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК ДокументПродажи,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку КАК ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки КАК ШаблонРассрочки,
	|	ВЫРАЗИТЬ(ТаблицаЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента КАК СуммаПродажи,
	|	ТаблицаЧленств.ЧленствоПакетУслуг.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТаблицаЧленств КАК ТаблицаЧленств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяПосещенияНеБолее,
	|	ЕСТЬNULL(ЧленстваПакетыУслугОстатки.КоличествоОстаток, 0),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг,
	|	2,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			ЧленствоПакетУслуг.Контрагент = &Клиент
	|				И ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И НЕ ЧленствоПакетУслуг.РезервироватьЗанятия
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЧленстваПакетыУслуг.Остатки(
	|				,
	|				НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг) ЕСТЬ NULL
	|					И ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).Контрагент = &Клиент
	|					И УслугаСегмент = НЕОПРЕДЕЛЕНО
	|					И НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ОбязательноеНаличиеРезерваПриВходе) КАК ЧленстваПакетыУслугОстатки
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугОстатки.Основание
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатусыЧленств.ЧленствоПакетУслуг,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ОграниченияПоВремениДействияИзменены,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧаще,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ПосещенийНеЧащеТип,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяПосещенияНеБолее,
	|	ЕСТЬNULL(ЧленстваПакетыУслугОстатки.КоличествоОстаток, 0),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугВремяДействия.(
	|		ДеньНедели,
	|		ВремяС,
	|		ВремяПо
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ЧленствоПакетУслугДоступКПомещениям.(
	|		Помещение
	|	),
	|	СтатусыЧленств.ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг,
	|	2,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура.ТребНалМедСправки,
	|	СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ОплачиваетсяВРассрочку,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).ШаблонРассрочки,
	|	ВЫРАЗИТЬ(СтатусыЧленств.ЧленствоПакетУслуг.ДокументПродажи КАК Документ.Реализация).СуммаДокумента,
	|	СтатусыЧленств.ЧленствоПакетУслуг.Номенклатура
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	|			&ТекущаяДата,
	|			&Клиент В (ЧленствоПакетУслуг.ДополнительныеВладельцы.Контрагент)
	|				И ЧленствоПакетУслуг.ВидЧленстваПакетаУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыЧленствПакетовУслуг.ОграниченПосещениями)
	|				И НЕ ЧленствоПакетУслуг.РезервироватьЗанятия
	|				И ЧленствоПакетУслуг.Проведен) КАК СтатусыЧленств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктурныеЕдиницыОбъектов КАК СтруктурныеЕдиницыОбъектов
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = СтруктурныеЕдиницыОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЧленстваПакетыУслуг.Остатки(
	|				,
	|				НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг) ЕСТЬ NULL
	|					И ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ДополнительныеВладельцы.Контрагент = &Клиент
	|					И УслугаСегмент = НЕОПРЕДЕЛЕНО
	|					И НЕ ВЫРАЗИТЬ(Основание КАК Документ.ЧленствоПакетУслуг).ОбязательноеНаличиеРезерваПриВходе) КАК ЧленстваПакетыУслугОстатки
	|		ПО СтатусыЧленств.ЧленствоПакетУслуг = ЧленстваПакетыУслугОстатки.Основание
	|ГДЕ
	|	СтатусыЧленств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	|	И СтруктурныеЕдиницыОбъектов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Клиент"			  , Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата"		  , ТекущаяДата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 
//ЗМВ}[+] 19.12.2025 10:02:43

// Функция, возвращает пол клиента.
//
Функция PocketKey_ПолучитьПолКлиента(ПолКлиента) Экспорт
	
	Если ЗначениеЗаполнено(ПолКлиента) Тогда
		Возврат ?(ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской, "male", "female");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Функция, возвращает стоимость купленных услуг.
//
Функция PocketKey_ПолучитьСтоимостьКупленныхУслуг(Дата, Клиент, Услуга, СтруктурнаяЕдиница, ВидЦен) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"              , Дата);
	Запрос.УстановитьПараметр("Контрагент"        , Клиент);
	Запрос.УстановитьПараметр("УслугаСолярия"     , Услуга);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.Текст  = МенеджерОборудованияСКУД_КОРП.ПолучитьТекстЗапросаСолярия();
	
	ТаблицаОснований = Запрос.Выполнить().Выгрузить();
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки",		Дата);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ВидЦен", 				ВидЦен);	
	СтруктураДанные.Вставить("Номенклатура", 		Услуга);
	
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	ОстатокКоличествоМинут  = ТаблицаОснований.Итог("Количество");
	Возврат ОстатокКоличествоМинут * СтруктураДанные.Цена;	
	
КонецФункции

// Функция, возвращает ссылку по УИД.
//
Функция PocketKey_ПолучитьСсылкуОбъектаПоУИД(UID, ВидОбъекта, ИмяОбъекта) Экспорт
	
	Попытка
		ИмяТаблицы = ВидОбъекта;
		Выполнить("ВидОбъекта = " + ВидОбъекта);
		Ссылка = ВидОбъекта[ИмяОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(UID));
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущиеДанные.Ссылка КАК Ссылка
		|ИЗ
		|	[ИмяТаблицы] КАК ТекущиеДанные
		|ГДЕ
		|	ТекущиеДанные.Ссылка = &Ссылка";
		
		ИмяТаблицы = Сред(ИмяТаблицы, 1, СтрДлина(ИмяТаблицы) - 1);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[ИмяТаблицы]", ИмяТаблицы + "." + ИмяОбъекта);
		
		Если Запрос.Выполнить().Пустой() Тогда
			Ссылка = Неопределено;
		КонецЕсли;		
		
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти

#Область Дополнительные_процедуры_и_функции

// Функция, проверяет состоит ли услуга в сегменте альтернативного времени.
//
Функция PocketKey_УслугаЗанятияВСегментеДобавленияВремени(Услуга, Сегмент = 1) Экспорт
	
	Если Сегмент = 1 Тогда
		лТекст = "
		|ВЫБРАТЬ
		|	СоставСегментов.Сегмент КАК Сегмент,
		|	СоставСегментов.ОбъектСегмента КАК ОбъектСегмента
		|ИЗ
		|	РегистрСведений.СоставСегментов КАК СоставСегментов
		|ГДЕ
		|	СоставСегментов.Сегмент.Наименование = ""Альтернативное время для переодевания""
		|	И СоставСегментов.ОбъектСегмента = &Услуга
		|";
	
	ИначеЕсли Сегмент = 2 Тогда
		лТекст = "
		|ВЫБРАТЬ
		|	СоставСегментов.Сегмент КАК Сегмент,
		|	СоставСегментов.ОбъектСегмента КАК ОбъектСегмента
		|ИЗ
		|	РегистрСведений.СоставСегментов КАК СоставСегментов
		|ГДЕ
		|	СоставСегментов.Сегмент.Наименование = ""Альтернативное время для переодевания (-30/+30)""
		|	И СоставСегментов.ОбъектСегмента = &Услуга
		|";
	//++ ЗМВ 06.05.2025	
	ИначеЕсли Сегмент = 3 Тогда
		лТекст = "
		|ВЫБРАТЬ
		|	СоставСегментов.Сегмент КАК Сегмент,
		|	СоставСегментов.ОбъектСегмента КАК ОбъектСегмента
		|ИЗ
		|	РегистрСведений.СоставСегментов КАК СоставСегментов
		|ГДЕ
		|	СоставСегментов.Сегмент.Наименование = ""Альтернативное время для переодевания (-60/+60)""
		|	И СоставСегментов.ОбъектСегмента = &Услуга
		|";
	//-- ЗМВ 06.05.2025	
	КонецЕсли;
	
	лЗапрос = Новый Запрос(лТекст);
	
	// Установка параметров.
	лЗапрос.УстановитьПараметр("Услуга", Услуга);
	
	Возврат НЕ лЗапрос.Выполнить().Пустой();
		
КонецФункции

// Функция, находит сотрудника по клиенту
//
Функция PocketKey_ПолучитьКакСотрудника(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Контрагент = &Контрагент
		|";

	Запрос = Новый Запрос(ТекстЗапроса);

	Запрос.УстановитьПараметр("Контрагент",	Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Ссылка;
		
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции

// Функция, возвращает доступ сотрудника по помещениям.
//
Функция PocketKey_ПолучитьДоступСотрудникаПоПомещениям(Сотрудник, МассивПомещений, ДатаВремяПрохода) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивПомещений) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не Сотрудник.ОграничениеПоПомещениям Тогда //В целях чтобы не ходили все у кого не настроены ограничения
		Возврат Ложь;
	КонецЕсли;	
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СотрудникиДоступКПомещениям.Ссылка КАК Ссылка,
	|	СотрудникиДоступКПомещениям.ДеньНедели КАК ДеньНедели
	|ИЗ
	|	Справочник.Сотрудники.ДоступКПомещениям КАК СотрудникиДоступКПомещениям
	|ГДЕ
	|	СотрудникиДоступКПомещениям.Ссылка = &Сотрудник
	|	И СотрудникиДоступКПомещениям.Помещение В(&МассивПомещений)
	|	И СотрудникиДоступКПомещениям.ВремяНачала <= &ВремяПрохода
	|	И ВЫБОР
	|			КОГДА СотрудникиДоступКПомещениям.ВремяОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА СотрудникиДоступКПомещениям.ВремяОкончания >= &ВремяПрохода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И СотрудникиДоступКПомещениям.ДеньНедели В(&ВремяДействия)");
	
	Запрос.УстановитьПараметр("Сотрудник"      , Сотрудник);
	Запрос.УстановитьПараметр("МассивПомещений", МассивПомещений);
	Запрос.УстановитьПараметр("ВремяДействия"  , ОбщегоНазначения.ПолучитьЗначенияВремениДействияПоДате(ДатаВремяПрохода));
	Запрос.УстановитьПараметр("ВремяПрохода"   , ОбщегоНазначения.ПолучитьВремяИзДаты(ДатаВремяПрохода));
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция, конвертирует карту.
//
Функция PocketKey_КонвертироватьКарту(КодКарты) Экспорт
	
	NumberChars = СтрДлина(КодКарты);
	bytes = Новый Массив(NumberChars/2);
	i=0;
	
	Пока i<NumberChars Цикл
		i=i+2;
		bytes[i/2-1] = Сред(КодКарты,i-1,2);
	КонецЦикла;
	
	Возврат bytes;
	
КонецФункции

// Функция, определяет адрес сервера в клубе.
//
Функция PocketKey_ОпределитьАдресСервера() Экспорт
	 	
	СтрокаСтруктурнаяЕдиница = "";
	СтрокаСтруктурнаяЕдиница = Строка(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Если ЗначениеЗаполнено(СтрокаСтруктурнаяЕдиница) Тогда
		Если СтрНайти(СтрокаСтруктурнаяЕдиница, "Жулебино") Тогда
			Возврат "192.168.170.10";
		ИначеЕсли СтрНайти(СтрокаСтруктурнаяЕдиница, "Люберцы") Тогда
			Возврат "10.50.0.11";	
		КонецЕсли;
	КонецЕсли;

	Возврат "";

КонецФункции

// Функция, возвращает последний проход клиента в клуб.
//
Функция PocketKey_ПолучитьПоследнийПроходВКлуб(Объект, КодКарты, ЭтоВход) Экспорт
	
	// Получим, все точки регистрации проходов в клуб
	//МассивУстройств = ПолучитьУстройстваРегистрацииПрохода();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект"         , Объект);
	//Запрос.УстановитьПараметр("КодКарты"       , КодКарты);
	//Запрос.УстановитьПараметр("Период"         , НачалоДня(ТекущаяДатаСеанса()));	
	//Запрос.УстановитьПараметр("МассивУстройств", МассивУстройств);
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Посещение.Ссылка КАК Ссылка,
		|	Посещение.Дата КАК Дата,
		|	Посещение.Контрагент КАК Контрагент,
		|	Посещение.Основание КАК Основание,
		|	Посещение.ДатаПрихода КАК ДатаПрихода,
		|	Посещение.ДатаУхода КАК ДатаУхода,
		|	Посещение.ПосещениеЗакрыто КАК ПосещениеЗакрыто,
		|	Посещение.ПризнакОтменен КАК ПризнакОтменен,
		|	Посещение.ПометкаУдаления КАК ПометкаУдаления,
		|	Посещение.Проведен КАК Проведен
		|ИЗ
		|	Документ.Посещение КАК Посещение
		|ГДЕ
		|	Посещение.Контрагент = &Объект
		//|	И Посещение.Дата >= &Период
		|	И Посещение.Проведен
		|	И НЕ Посещение.ПометкаУдаления
		|	И НЕ Посещение.ПризнакОтменен
		|	И НЕ Посещение.ПосещениеЗакрыто
		|
		|УПОРЯДОЧИТЬ ПО
		|	Посещение.Дата УБЫВ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	
	Если Результат.Количество() > 0 И ЭтоВход Тогда			//Вход, нет посещений или они закрыты
		Возврат Истина;
	ИначеЕсли Результат.Количество() = 0 И НЕ ЭтоВход Тогда //Выход, есть не закрытое посещение
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

//++ ЗМВ 18.06.2025

//функция, возвращает занятие в СПА на сегодняшний день
//
Функция PocketKey_ПолучитьЗанятиеСПА()Экспорт

	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Занятие.Ссылка КАК Ссылка,
	|	Занятие.Помещение КАК Помещение
	|ИЗ
	|	Документ.Занятие КАК Занятие
	|ГДЕ
	|	Занятие.Помещение.Наименование ПОДОБНО ""%СПА+УЛ.БАС%""
	|	И Занятие.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ Занятие.ПометкаУдаления
	|	И Занятие.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Запланировано)	
	|";
	
	Запрос = Новый Запрос(лТекст);
		
	// Установка параметров.
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДатаСеанса()));	
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции  

//Функция возвращает состав занятия за сегодняшний день в СПА+УЛ.БАС
//
Функция ЗаписанныйКлиентНаЗанятиеСПА1(Контрагент)Экспорт 
	
	лТекст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗанятиеСоставЗанятия.Ссылка КАК Тренировка,
		|	ЗанятиеСоставЗанятия.Ссылка.ДатаВремяНачала КАК ДатаВремяНачала,
		|	ЗанятиеСоставЗанятия.Ссылка.ДатаВремяОкончания КАК ДатаВремяОкончания,
		|	ЗанятиеСоставЗанятия.Ссылка.ЕмкостьГруппы КАК ЕмкостьГруппы,
		|	ЗанятиеСоставЗанятия.Ссылка.Номенклатура КАК Номенклатура,
		|	ЗанятиеСоставЗанятия.Ссылка.Помещение КАК Помещение,
		|	ЗанятиеСоставЗанятия.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗанятиеСоставЗанятия.Контрагент КАК Контрагент,
		|	ЗанятиеСоставЗанятия.КонтрагентСписания КАК КонтрагентСписания,
		|	ЗанятиеСоставЗанятия.ОснованиеОплаты КАК ОснованиеОплаты
		|ИЗ
		|	Документ.Занятие.СоставЗанятия КАК ЗанятиеСоставЗанятия
		|ГДЕ
		|	ЗанятиеСоставЗанятия.Ссылка.ДатаВремяНачала МЕЖДУ &ПериодДатаНачала И &ПериодДатаОкончания
		|	И ЗанятиеСоставЗанятия.Ссылка.Проведен
		|	И ЗанятиеСоставЗанятия.Ссылка.ТипЗанятия = ЗНАЧЕНИЕ(Перечисление.ТипыЗанятий.ГрупповоеЗанятие)
		|	И ЗанятиеСоставЗанятия.СтатусПрибытия <> 2
		|	И ВЫБОР
		|			КОГДА ЗанятиеСоставЗанятия.Ссылка.Сотрудник.Контрагент = ЗанятиеСоставЗанятия.Контрагент
		|					ИЛИ ЗанятиеСоставЗанятия.Ссылка.СотрудникДоИзменения.Контрагент = ЗанятиеСоставЗанятия.Контрагент
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ЗанятиеСоставЗанятия.Ссылка.Помещение = &Помещение
		|	И ЗанятиеСоставЗанятия.Контрагент = &Контрагент
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗанятиеСоставЗанятия.Занятие,
		|	ЗанятиеСоставЗанятия.Занятие.ДатаВремяНачала,
		|	ЗанятиеСоставЗанятия.Занятие.ДатаВремяОкончания,
		|	ЗанятиеСоставЗанятия.Занятие.ЕмкостьГруппы,
		|	ЗанятиеСоставЗанятия.Занятие.Номенклатура,
		|	ЗанятиеСоставЗанятия.Занятие.Помещение,
		|	ЗанятиеСоставЗанятия.Занятие.СтруктурнаяЕдиница,
		|	ЗанятиеСоставЗанятия.Контрагент,
		|	ЗанятиеСоставЗанятия.КонтрагентСписания,
		|	ЗанятиеСоставЗанятия.ОснованиеОплаты
		|ИЗ
		|	Документ.ЗаписьНаЗанятие КАК ЗанятиеСоставЗанятия
		|ГДЕ
		|	ЗанятиеСоставЗанятия.Занятие.ДатаВремяНачала МЕЖДУ &ПериодДатаНачала И &ПериодДатаОкончания
		|	И ЗанятиеСоставЗанятия.Занятие.Проведен
		|	И ЗанятиеСоставЗанятия.Занятие.ТипЗанятия = ЗНАЧЕНИЕ(Перечисление.ТипыЗанятий.ГрупповоеЗанятие)
		|	И ЗанятиеСоставЗанятия.СтатусПрибытия <> 2
		|	И ВЫБОР
		|			КОГДА ЗанятиеСоставЗанятия.Занятие.Сотрудник.Контрагент = ЗанятиеСоставЗанятия.Контрагент
		|					ИЛИ ЗанятиеСоставЗанятия.Занятие.СотрудникДоИзменения.Контрагент = ЗанятиеСоставЗанятия.Контрагент
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ЗанятиеСоставЗанятия.Занятие.Помещение = &Помещение
		|	И ЗанятиеСоставЗанятия.Контрагент = &Контрагент
		|";
	
	Запрос = Новый Запрос(лТекст);
	
	// Присвоение значений переменным параметров.
	Помещение = Справочники.Помещения.НайтиПоНаименованию("СПА+УЛ.БАС"); // СПА+УЛ.БАС (000000023)
	
	// Установка параметров.
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПериодДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ПериодДатаОкончания", КонецДня(ТекущаяДатаСеанса()));
	
	ТаблицаЗначений =  Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗначений.Количество() <> 0 Тогда
	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	
	КонецЕсли; 
	
КонецФункции 

//Функция возвращает состав занятия за сегодняшний день в СПА+УЛ.БАС
//
Функция ЗаписанныйКлиентНаЗанятиеСПА(Контрагент,Занятие)Экспорт 
	
	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗаписьНаЗанятие.Ссылка КАК Ссылка,
	|	ЗаписьНаЗанятие.Контрагент КАК Контрагент,
	|	ЗаписьНаЗанятие.КонтрагентСписания КАК КонтрагентСписания,
	|	ЗаписьНаЗанятие.Занятие КАК Занятие,
	|	ЗаписьНаЗанятие.СтатусПрибытия КАК СтатусПрибытия
	|ИЗ
	|	Документ.ЗаписьНаЗанятие КАК ЗаписьНаЗанятие
	|ГДЕ
	|	НЕ ЗаписьНаЗанятие.ПометкаУдаления
	|	И ЗаписьНаЗанятие.Проведен
	|	И ЗаписьНаЗанятие.Занятие = &Занятие
	|	И ЗаписьНаЗанятие.Контрагент = &Контрагент
	|	И ЗаписьНаЗанятие.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаписьНаЗанятие.ДатаОтмены = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаписьНаЗанятие.Дата УБЫВ
	|";
	
	Запрос = Новый Запрос(лТекст);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Занятие", 		Занятие);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	
	
	ТаблицаЗначений =  Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗначений.Количество() <> 0 Тогда	
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли; 
		
КонецФункции

//-- ЗМВ 18.06.2025

#КонецОбласти

// Процедура, отправляет сообщения
//
Процедура ОтправитьОшибку(Текст) Экспорт
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	СтрокаСтруктурнаяЕдиница	= "%F0%9F%8F%86" + " " + Строка(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница) + Символы.ПС;
	СтрокаПользователь			= "%F0%9F%91%A4" + " " + Строка(Пользователь) + Символы.ПС;
	
	Если ЗначениеЗаполнено(Пользователь.Должность) Тогда
		СтрокаДолжность			= "%F0%9F%91%A4" + " " + Строка(Пользователь.Должность) + Символы.ПС;
	КонецЕсли;	
	
	ДопТекст = СтрокаСтруктурнаяЕдиница + СтрокаПользователь + СтрокаДолжность + Символы.ПС;
	Текст = "%F0%9F%93%84" + " " + Текст;
	
	Хост	= "api.telegram.org";
	Порт	= 443;
	
	Токен = "6071993599:AAEcYx35BzaSenxuF5nkd7asU8VTq58dmwM";
	
	Метод	= "sendMessage";
	
	Чат		= "451366437";	
	
	Запрос = "bot" + Токен + "/" + Метод + "?" + "chat_id=" + Чат + "&text=" + ДопТекст + Текст; 
	
	HTTPСоединение	= Новый HTTPСоединение(Хост, Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());	  
	HTTPЗапрос		= Новый HTTPЗапрос(Запрос, Новый Соответствие());	
	HTTPСоединение.Получить(HTTPЗапрос);
	
КонецПроцедуры

Процедура ОтправитьСообщение(Текст) Экспорт
	
	Возврат;
	
КонецПроцедуры

//Функция, возвращает текущую структурную единицу как строку
//
Функция ПолучитьТекущуюСтруктурнуюЕдиницуКакСтроку() Экспорт
	
	Возврат Строка(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
КонецФункции
